---
kind: other
id: Methods.T:Autodesk.Revit.DB.IFC.IFCImportOptions
source: html/97e1d908-aa8f-a5a2-cea4-6b7780da49da.htm
---
# IFCImportOptions Methods

Get the data used in the creation of the associated Revit file for an IFC link operation, if it exists.